In [1]:
import pandas as pd
import numpy as np
import math

In [2]:
df = pd.read_csv("Data1.csv")
df

  Customer  Age  Income(k)  No. Card Response
0     John   35         35         3       NO
1   Rachel   22         50         2      YES
2   Hannah   63        200         1       NO
3      Tom   59        170         1       NO
4   Nellie   25         40         4      YES
5    David   37         50         2      YES

In [3]:
test = df[-1:]
test

  Customer  Age  Income(k)  No. Card Response
5    David   37         50         2      YES

In [4]:
train = df[:-1]
train

  Customer  Age  Income(k)  No. Card Response
0     John   35         35         3       NO
1   Rachel   22         50         2      YES
2   Hannah   63        200         1       NO
3      Tom   59        170         1       NO
4   Nellie   25         40         4      YES

In [5]:
def most_frequent(List): 
    counter = 0
    num = List[0]
    
    for i in List:
        curr_frequency = List.count(i)
        if(curr_frequency> counter):
            counter = curr_frequency
            num = i
    return num

In [6]:
def KNN(data, test, k = 3):
    _dist = {}
    for i in data:
        dist = 0
        for j in range(1,4):
            dist += (test[0][j] - i[j]) ** 2
        _dist[math.sqrt(dist)] = i[-1]
    print(_dist)
    
    top = []
    count = 0
    for i in sorted (_dist.keys()):
        top.append(_dist[i])
        count+=1
        if(count == k):
            break
    print("closest:", top)
    return most_frequent(top)

In [7]:
result = KNN(train.to_numpy(), test.to_numpy())

{15.165750888103101: 'NO', 15.0: 'YES', 152.23994219652081: 'NO', 122.00409829181969: 'NO', 15.748015748023622: 'YES'}
closest: ['YES', 'NO', 'YES']

In [8]:
print(result)

YES